busy-app/busybar-firmware/lib/simplicity_sdk_new/devices/platform/Device/SiliconLabs/BGM27/Include/bgm27_usart.h
/* Bit fields for USART RXDATAX */
#define _USART_RXDATAX_RESETVALUE               0x00000000UL                            /**< Default value for USART_RXDATAX             */
#define _USART_RXDATAX_MASK                     0x0000C1FFUL                            /**< Mask for USART_RXDATAX                      */
#define _USART_RXDATAX_RXDATA_SHIFT             0                                       /**< Shift value for USART_RXDATA                */
#define _USART_RXDATAX_RXDATA_MASK              0x1FFUL                                 /**< Bit mask for USART_RXDATA                   */
#define _USART_RXDATAX_RXDATA_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_RXDATAX              */
#define USART_RXDATAX_RXDATA_DEFAULT            (_USART_RXDATAX_RXDATA_DEFAULT << 0)    /**< Shifted mode DEFAULT for USART_RXDATAX      */
#define USART_RXDATAX_PERR                      (0x1UL << 14)                           /**< Data Parity Error                           */
#define _USART_RXDATAX_PERR_SHIFT               14                                      /**< Shift value for USART_PERR                  */
#define _USART_RXDATAX_PERR_MASK                0x4000UL                                /**< Bit mask for USART_PERR                     */
#define _USART_RXDATAX_PERR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_RXDATAX              */
#define USART_RXDATAX_PERR_DEFAULT              (_USART_RXDATAX_PERR_DEFAULT << 14)     /**< Shifted mode DEFAULT for USART_RXDATAX      */
#define USART_RXDATAX_FERR                      (0x1UL << 15)                           /**< Data Framing Error                          */
#define _USART_RXDATAX_FERR_SHIFT               15                                      /**< Shift value for USART_FERR                  */
#define _USART_RXDATAX_FERR_MASK                0x8000UL                                /**< Bit mask for USART_FERR                     */
#define _USART_RXDATAX_FERR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_RXDATAX              */
#define USART_RXDATAX_FERR_DEFAULT              (_USART_RXDATAX_FERR_DEFAULT << 15)     /**< Shifted mode DEFAULT for USART_RXDATAX      */

/* Bit fields for USART RXDATA */
#define _USART_RXDATA_RESETVALUE                0x00000000UL                            /**< Default value for USART_RXDATA              */
#define _USART_RXDATA_MASK                      0x000000FFUL                            /**< Mask for USART_RXDATA                       */
#define _USART_RXDATA_RXDATA_SHIFT              0                                       /**< Shift value for USART_RXDATA                */
#define _USART_RXDATA_RXDATA_MASK               0xFFUL                                  /**< Bit mask for USART_RXDATA                   */
#define _USART_RXDATA_RXDATA_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_RXDATA               */
#define USART_RXDATA_RXDATA_DEFAULT             (_USART_RXDATA_RXDATA_DEFAULT << 0)     /**< Shifted mode DEFAULT for USART_RXDATA       */

/* Bit fields for USART RXDOUBLEX */
#define _USART_RXDOUBLEX_RESETVALUE             0x00000000UL                             /**< Default value for USART_RXDOUBLEX           */
#define _USART_RXDOUBLEX_MASK                   0xC1FFC1FFUL                             /**< Mask for USART_RXDOUBLEX                    */
#define _USART_RXDOUBLEX_RXDATA0_SHIFT          0                                        /**< Shift value for USART_RXDATA0               */
#define _USART_RXDOUBLEX_RXDATA0_MASK           0x1FFUL                                  /**< Bit mask for USART_RXDATA0                  */
#define _USART_RXDOUBLEX_RXDATA0_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_RXDOUBLEX            */
#define USART_RXDOUBLEX_RXDATA0_DEFAULT         (_USART_RXDOUBLEX_RXDATA0_DEFAULT << 0)  /**< Shifted mode DEFAULT for USART_RXDOUBLEX    */
#define USART_RXDOUBLEX_PERR0                   (0x1UL << 14)                            /**< Data Parity Error 0                         */
#define _USART_RXDOUBLEX_PERR0_SHIFT            14                                       /**< Shift value for USART_PERR0                 */
#define _USART_RXDOUBLEX_PERR0_MASK             0x4000UL                                 /**< Bit mask for USART_PERR0                    */
#define _USART_RXDOUBLEX_PERR0_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USART_RXDOUBLEX            */
#define USART_RXDOUBLEX_PERR0_DEFAULT           (_USART_RXDOUBLEX_PERR0_DEFAULT << 14)   /**< Shifted mode DEFAULT for USART_RXDOUBLEX    */
#define USART_RXDOUBLEX_FERR0                   (0x1UL << 15)                            /**< Data Framing Error 0                        */
#define _USART_RXDOUBLEX_FERR0_SHIFT            15                                       /**< Shift value for USART_FERR0                 */
#define _USART_RXDOUBLEX_FERR0_MASK             0x8000UL                                 /**< Bit mask for USART_FERR0                    */
#define _USART_RXDOUBLEX_FERR0_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USART_RXDOUBLEX            */
#define USART_RXDOUBLEX_FERR0_DEFAULT           (_USART_RXDOUBLEX_FERR0_DEFAULT << 15)   /**< Shifted mode DEFAULT for USART_RXDOUBLEX    */
#define _USART_RXDOUBLEX_RXDATA1_SHIFT          16                                       /**< Shift value for USART_RXDATA1               */
#define _USART_RXDOUBLEX_RXDATA1_MASK           0x1FF0000UL                              /**< Bit mask for USART_RXDATA1                  */
#define _USART_RXDOUBLEX_RXDATA1_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_RXDOUBLEX            */
#define USART_RXDOUBLEX_RXDATA1_DEFAULT         (_USART_RXDOUBLEX_RXDATA1_DEFAULT << 16) /**< Shifted mode DEFAULT for USART_RXDOUBLEX    */
#define USART_RXDOUBLEX_PERR1                   (0x1UL << 30)                            /**< Data Parity Error 1                         */
#define _USART_RXDOUBLEX_PERR1_SHIFT            30                                       /**< Shift value for USART_PERR1                 */
#define _USART_RXDOUBLEX_PERR1_MASK             0x40000000UL                             /**< Bit mask for USART_PERR1                    */
#define _USART_RXDOUBLEX_PERR1_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USART_RXDOUBLEX            */
#define USART_RXDOUBLEX_PERR1_DEFAULT           (_USART_RXDOUBLEX_PERR1_DEFAULT << 30)   /**< Shifted mode DEFAULT for USART_RXDOUBLEX    */
#define USART_RXDOUBLEX_FERR1                   (0x1UL << 31)                            /**< Data Framing Error 1                        */
#define _USART_RXDOUBLEX_FERR1_SHIFT            31                                       /**< Shift value for USART_FERR1                 */
#define _USART_RXDOUBLEX_FERR1_MASK             0x80000000UL                             /**< Bit mask for USART_FERR1                    */
#define _USART_RXDOUBLEX_FERR1_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USART_RXDOUBLEX            */
#define USART_RXDOUBLEX_FERR1_DEFAULT           (_USART_RXDOUBLEX_FERR1_DEFAULT << 31)   /**< Shifted mode DEFAULT for USART_RXDOUBLEX    */

/* Bit fields for USART RXDOUBLE */
#define _USART_RXDOUBLE_RESETVALUE              0x00000000UL                            /**< Default value for USART_RXDOUBLE            */
#define _USART_RXDOUBLE_MASK                    0x0000FFFFUL                            /**< Mask for USART_RXDOUBLE                     */
#define _USART_RXDOUBLE_RXDATA0_SHIFT           0                                       /**< Shift value for USART_RXDATA0               */
#define _USART_RXDOUBLE_RXDATA0_MASK            0xFFUL                                  /**< Bit mask for USART_RXDATA0                  */
#define _USART_RXDOUBLE_RXDATA0_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USART_RXDOUBLE             */
#define USART_RXDOUBLE_RXDATA0_DEFAULT          (_USART_RXDOUBLE_RXDATA0_DEFAULT << 0)  /**< Shifted mode DEFAULT for USART_RXDOUBLE     */
#define _USART_RXDOUBLE_RXDATA1_SHIFT           8                                       /**< Shift value for USART_RXDATA1               */
#define _USART_RXDOUBLE_RXDATA1_MASK            0xFF00UL                                /**< Bit mask for USART_RXDATA1                  */
#define _USART_RXDOUBLE_RXDATA1_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USART_RXDOUBLE             */
#define USART_RXDOUBLE_RXDATA1_DEFAULT          (_USART_RXDOUBLE_RXDATA1_DEFAULT << 8)  /**< Shifted mode DEFAULT for USART_RXDOUBLE     */

